{
  "portfolioName": "HIMANI BHARDWAJ",
  "professionalTitle": "Software Developer",
  "email": "himanibhardwaj501@gmail.com",
  "formspreeEndpoint": "https://formspree.io/f/mleqjkyk",
  "aboutMe": "I'm delighted to share a glimpse of my journey with you. As a <b>Full Stack Developer</b>, I thrive on crafting captivating websites using cutting-edge technologies like ReactJS, NodeJS, and REST APIs. <br/><br/> My academic journey led me to complete <b>M.Tech</b> from the prestigious <b>International Institute of Information Technology, Bangalore</b> (IIIT - B) in <b>2021</b>. Currently, I'm embracing the dynamic world of software development as a proud member of IBM India Software Labs (ISL) in Bangalore. At IBM, I've had the privilege of delving into both full-stack and DevOps development, enriching my skill set along the way.<br/><br/>Beyond the realm of technology, I find joy in various pursuits. From engaging in sports to strumming a melody on musical instruments, I'm always seeking new experiences. Exploring new destinations, connecting with diverse individuals, and immersing myself in different cultures are endeavors that truly invigorate me.<br/><br/>If you're reading this, I'd love to connect with you! Feel free to reach out or follow me on <b>LinkedIn</b>. Let's embark on an exciting journey together! Looking forward to connecting with you soon.<br/><br/>Best Regards :)",
  "socialMediaLinks": {
    "linkedin": "https://www.linkedin.com/in/himani-bhardwaj/",
    "github": "https://github.com/himani501/",
    "code": "https://leetcode.com/babylearner/",
    "gmail": "mailto:himanibhardwaj501@gmail.com",
    "facebook": "https://www.facebook.com/himaaanii/",
    "instagram": "https://www.instagram.com/himaaaaniiiii/"
  },
  "skills": [ "JavaScript", "ReactJS", "NodeJS", "C++","Algorithms","GIT", "Data Structures","DevOps", "Jenkins", "Docker", "REST Apis", "Open APIs", "Automation", "Argo CD", "Codecept JS", "JEST", "Mocha/Chai"],
  "projects": [
    {
      "projectName": "TALE OF TALENTS",
      "projectDescription": "Tale of Talents is an open-source project based on React JS, which can be used as a template by any user and facilitates them to build their own portfolio quickly. It provides a config file to fill in the user's required information, and then you are good to go. This portfolio website is also made using the Tale of Talents project.",
      "projectLink": "https://github.com/himani501/Tale-of-Talents",
      "projectImagePath": "tale-of-talents.png"
    },
    {
      "projectName": "DreamShoppe",
      "projectDescription": "DreamShoppe is an e-commerce platform built with React for the frontend and Node.js for the backend. It offers a diverse range of products and ensures a seamless shopping experience. With its intuitive UI and robust backend, DreamShoppe prioritizes user satisfaction, security, and convenience, making it a premier destination for online shopping.",
      "projectLink": "https://github.com/himani501/DreamShoppe",
      "projectImagePath": "dreamshoppe-1.png"
    }
  ],
  "blogs": [
    {
      "blogTitle": "Using IBM® App Connect to interact with IBM DB2 onCloud",
      "blogLink": "https://community.ibm.com/community/user/integration/blogs/himani-bhardwaj2/2023/07/10/using-ibmappconnect-to-interact-with-ibm-db2cloud",
      "blogDescription": "IBM App Connect is an integration platform designed to facilitate seamless connectivity between multiple applications, which we refer to as \"connectors\". As part of the IBM App Connect team, there was a business requirement to support a JDBC-based DB2 connector on AceCCmt. I developed the new IBM DB2 connector from scratch, which is now being used in the production environment and available for customers. This blog post describes the usability and functionality of the IBM DB2 connector for customers."
    }
  ]
}